РП/src/Reports/СхемаМаршрутнойКарты/СхемаМаршрутнойКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СхемаМаршрутнойКарты</name>
  <attributes>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьОперацииВложенныхМаршрутов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

РП/src/Catalogs/ВидыРабочихЦентров/ВидыРабочихЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРабочихЦентров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйЗначимыйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьДоступностьПоГрафикуРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДоступностьРЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДоступностиРЦ</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяВариантыНаладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениПереналадки</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараллельнаяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихЦентров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьДоступностьДляВидаРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.МаршрутныеКарты</owners>
  <attributes>
    <name>НомерОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующейОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
      <types>CatalogRef.ВидыРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитВложенныйМаршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйМаршрут</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяШтучноеЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПЗЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВспомогательныеРабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Reports/СхемаМаршрутнойКарты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем МаксУровень;

Функция ПолучитьЭтапыПредшественники(НомерОперации, Процесс, Уровень)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическиеОперации.Ссылка КАК ЭтапПроцесса,
	               |	ВЫБОР
	               |		КОГДА ТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
	               |			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра.Подразделение, """")
	               |		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.ВидыРабочихЦентров).Подразделение, """")
	               |	КОНЕЦ КАК Цех
	               |ИЗ
	               |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |ГДЕ
	               |	ТехнологическиеОперации.Владелец = &МаршрутнаяКарта
	               |	И НЕ ТехнологическиеОперации.ПометкаУдаления
	               |	И ТехнологическиеОперации.НомерСледующейОперации = &НомерОперации
	               |	И (&Уровень = 1
	               |			ИЛИ &ПоказатьОперацииВложенныхМаршрутов
	               |			ИЛИ ТехнологическиеОперации.СодержитВложенныйМаршрут)";

	Запрос.УстановитьПараметр("МаршрутнаяКарта", Процесс);
	Запрос.УстановитьПараметр("НомерОперации",   НомерОперации);
	Запрос.УстановитьПараметр("Уровень", Уровень);
	Запрос.УстановитьПараметр("ПоказатьОперацииВложенныхМаршрутов", ПоказатьОперацииВложенныхМаршрутов);
		
 	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДобавитьЭтапыПроцесса(Процесс, ЭтапыПроцесса, Уровень, СписокМаршрутныхКарт, Отказ)

	Если НЕ Справочники.МаршрутныеКарты.ПоследовательностьОперацийПравильная(МаршрутнаяКарта, Отказ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическиеОперации.Владелец КАК Владелец,
	               |	ТехнологическиеОперации.Ссылка КАК Этап,
	               |	ТехнологическиеОперации.Представление КАК ПредставлениеЭтапа,
	               |	ТехнологическиеОперации.Ссылка КАК Расшифровка,
	               |	ТехнологическиеОперации.НомерОперации КАК НомерОперации,
	               |	ТехнологическиеОперации.НомерСледующейОперации КАК НомерСледующейОперации,
	               |	ТехнологическиеОперации.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТехнологическиеОперации.СодержитВложенныйМаршрут КАК СодержитВложенныйМаршрут,
	               |	ТехнологическиеОперации.ВложенныйМаршрут КАК ВложенныйМаршрут,
	               |	ТехнологическиеОперации.РабочийЦентр.Представление КАК РабочийЦентрПредставление,
	               |	ВЫБОР
	               |		КОГДА ТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
	               |			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра.Подразделение, """")
	               |		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.ВидыРабочихЦентров).Подразделение, """")
	               |	КОНЕЦ КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА ТехнологическиеОперации.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
	               |			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.РабочиеЦентры).ВидРабочегоЦентра.Подразделение.Представление, """")
	               |		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТехнологическиеОперации.РабочийЦентр КАК Справочник.ВидыРабочихЦентров).Подразделение.Представление, """")
	               |	КОНЕЦ КАК ПодразделениеПредставление
	               |ИЗ
	               |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |ГДЕ
	               |	ТехнологическиеОперации.Владелец = &МаршрутнаяКарта
	               |	И НЕ ТехнологическиеОперации.ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("МаршрутнаяКарта", Процесс);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если ЭтапыПроцесса = Неопределено Тогда
		ЭтапыПроцесса = РезультатЗапроса.СкопироватьКолонки();
		УниверсальнаяОбработкаПроцессов.ДобавитьОбязательныеКолонкиВЭтапыПроцесса(ЭтапыПроцесса);
	КонецЕсли;
	
	// Оставим только вложенные маршруты
	Если Уровень > 1 И НЕ ПоказатьОперацииВложенныхМаршрутов Тогда
		МассивОпераций = Новый Массив;
		
		Для каждого Выборка Из РезультатЗапроса Цикл
			Если НЕ Выборка.СодержитВложенныйМаршрут Тогда
				МассивОпераций.Добавить(Выборка.Этап);
			КонецЕсли;
		КонецЦикла; 
		
		// Удалим операции
		Для каждого Этап Из МассивОпераций Цикл
			УдаляемыйЭтап = РезультатЗапроса.Найти(Этап, "Этап");
			ПредыдущиеЭтапы = РезультатЗапроса.НайтиСтроки(Новый Структура("НомерСледующейОперации", УдаляемыйЭтап.НомерОперации));
			Для каждого ПредыдущийЭтап Из ПредыдущиеЭтапы Цикл
				ПредыдущийЭтап.НомерСледующейОперации = УдаляемыйЭтап.НомерСледующейОперации;
			КонецЦикла;
			РезультатЗапроса.Удалить(УдаляемыйЭтап);
		КонецЦикла; 
	КонецЕсли; 
	
	Если Уровень = 1 ИЛИ ПоказатьОперацииВложенныхМаршрутов Тогда
		СписокМаршрутныхКарт.Добавить(Процесс);
	КонецЕсли; 
	
	Для каждого Выборка Из РезультатЗапроса Цикл
		
		СтрокаЭтапа = ЭтапыПроцесса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЭтапа, Выборка);
		СтрокаЭтапа.ПорядковыйНомер = Формат(МаксУровень - Уровень, "ЧГ=0") + "_" + Формат(Выборка.НомерОперации, "ЧГ=0");
		
		СтрокаЭтапа.ЭтапыПредшественники = ПолучитьЭтапыПредшественники(СтрокаЭтапа.НомерОперации, Процесс, Уровень);
		
		Если Выборка.СодержитВложенныйМаршрут Тогда
			ЭтапыВложенногоМаршрута = ДобавитьЭтапыПроцесса(Выборка.ВложенныйМаршрут, ЭтапыПроцесса, Уровень + 1, СписокМаршрутныхКарт, Отказ);
			Для каждого ЭлементКоллекции Из ЭтапыВложенногоМаршрута Цикл
				НоваяСтрока = СтрокаЭтапа.ЭтапыПредшественники.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
			КонецЦикла;
			Если НЕ ПоказатьОперацииВложенныхМаршрутов Тогда
				СтрокаЭтапа.Владелец = Выборка.ВложенныйМаршрут;
				СписокМаршрутныхКарт.Добавить(Выборка.ВложенныйМаршрут);
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	ПредшественникиТекущегоПроцесса = Новый ТаблицаЗначений;
	ПредшественникиТекущегоПроцесса.Колонки.Добавить("ЭтапПроцесса",  Новый ОписаниеТипов("СправочникСсылка.ТехнологическиеОперации"));
	ПредшественникиТекущегоПроцесса.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	
	Для каждого Выборка Из РезультатЗапроса Цикл
		Если Выборка.НомерСледующейОперации = 0 Тогда
			Этап = ПредшественникиТекущегоПроцесса.Добавить();
			Этап.ЭтапПроцесса  = Выборка.Этап;
			Этап.Подразделение = Выборка.Подразделение;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ПредшественникиТекущегоПроцесса;
	
КонецФункции

Функция СформироватьОтчет(ПолеТабличногоДокумента) Экспорт
	
	Отказ = Ложь;
	
	МаксУровень = 1000;
	
	ЭтапыПроцесса = Неопределено;
	СписокМаршрутныхКарт = Новый Массив;
	ДобавитьЭтапыПроцесса(МаршрутнаяКарта, ЭтапыПроцесса, 1, СписокМаршрутныхКарт, Отказ);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Макет = ПолучитьМакет("Макет");
	
	// Если маршрутных карт больше 1, то раскрасим операции
	СписокЦветов = Новый Массив;
	Если СписокМаршрутныхКарт.Количество() > 1 Тогда
		Область_Цвета = Макет.ПолучитьОбласть("ВложенныеМК_Цвета");
		Для Сч = 1 По Область_Цвета.ВысотаТаблицы Цикл
			СписокЦветов.Добавить(Область_Цвета.Область(Сч,1,Сч,1).ЦветФона);
		КонецЦикла;
	КонецЕсли; 
	
	ЭтапыПроцесса.Колонки.Добавить("Текст1", Новый ОписаниеТипов("Строка"));
	ЭтапыПроцесса.Колонки.Добавить("Текст2", Новый ОписаниеТипов("Строка"));
	
	Для каждого СтрокаЭтапа Из ЭтапыПроцесса Цикл
		Если СтрокаЭтапа.СодержитВложенныйМаршрут Тогда
			СтрокаЭтапа.Текст1 = НСтр("ru='Вложенный маршрут';uk='Вкладений маршрут'");
		Иначе	
			СтрокаЭтапа.Текст1 = НСтр("ru='%1';uk='%1'");
			СтрокаЭтапа.Текст1 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											СтрокаЭтапа.Текст1, 
											СтрокаЭтапа.ПодразделениеПредставление);
			
			СтрокаЭтапа.Текст2 = СтрокаЭтапа.РабочийЦентрПредставление;
			СтрокаЭтапа.ПараметрыВывода.Вставить("РазмещениеТекста2", ТипРазмещенияТекстаТабличногоДокумента.Переносить);
		КонецЕсли;
		
		ЦветФонаЭтапа = ПолучитьЦветМаршрутнойКарты(СписокМаршрутныхКарт.Найти(СтрокаЭтапа.Владелец), СписокЦветов);;
		СтрокаЭтапа.ПараметрыВывода.Вставить("ЦветФонаЭтапа", ЦветФонаЭтапа);
	КонецЦикла;
	
	Результат = УниверсальнаяОбработкаПроцессов.СформироватьГрафическоеПредставлениеПроцесса(ЭтапыПроцесса);
	
	ПолеТабличногоДокумента.Очистить();
	
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	
	// Заголовок
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.МаршрутнаяКарта = МаршрутнаяКарта;
	
	ПолеТабличногоДокумента.Вывести(ОбластьЗаголовок);
	
	// Список вложенных маршртуных карт
	Если СписокМаршрутныхКарт.Количество() > 1 Тогда
		ПолеТабличногоДокумента.Вывести(ОбластьОтступ);
		ПолеТабличногоДокумента.Вывести(Макет.ПолучитьОбласть("ВложенныеМК_Заголовок"));
		ПолеТабличногоДокумента.НачатьГруппуСтрок(, Ложь);
		
		ОбластьВложенныеМК_Строка = Макет.ПолучитьОбласть("ВложенныеМК_Строка");
		Для каждого МаршрутнаяКартаСхемы Из СписокМаршрутныхКарт Цикл
			ОбластьВложенныеМК_Строка.Область(1,2,1,2).ЦветФона = ПолучитьЦветМаршрутнойКарты(СписокМаршрутныхКарт.Найти(МаршрутнаяКартаСхемы), СписокЦветов);
			ОбластьВложенныеМК_Строка.Параметры.МаршрутнаяКарта = МаршрутнаяКартаСхемы;
			ПолеТабличногоДокумента.Вывести(ОбластьВложенныеМК_Строка);
		КонецЦикла;
		ПолеТабличногоДокумента.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
	// Схема
	ПолеТабличногоДокумента.Вывести(Результат.ТабличныйДокумент);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЦветМаршрутнойКарты(НомерШаблона, СписокЦветов)

	Если НомерШаблона < СписокЦветов.ВГраница() Тогда
		Возврат СписокЦветов.Получить(НомерШаблона)
	Иначе
		Возврат Новый Цвет;
	КонецЕсли; 

КонецФункции
 
#КонецЕсли
